{
  "event": [
    {
      "month": 6,
      "day": 22,
      "year": 2019,
      "title": "BarRoom Preachers & C&S Rollin’ Smoke!",
      "description": "On June 22, we will have live music featuring BarRoom Preachers and delicious BBQ by C&S Rollin’ Smoke! Cheers!",
      "link": "https://www.facebook.com/events/454417102044104/",
      "class": "d-Block"
    },
    {
      "month": 6,
      "day": 28,
      "year": 2019,
      "title": "Bryan Shayne and Texasiana Famous Food!",
      "description": "Next Friday!! Enjoy and dance to live music by the awesome Bryan Shayne 6-9p and grub on some delicious food by Texasiana 5-9p!! And of course, enjoy great craft beers 3-10p! Cheers!",
      "link": "https://www.facebook.com/events/528064444397349/",
      "class": "d-Block"
    },
    {
      "month": 6,
      "day": 30,
      "year": 2019,
      "title": "June Jeep Meet",
      "description": "OlllllllO We love seeing those Jeeps! Next meet will be June 30th 2-6pm. Let’s talk Jeeps over cold craft beer! We also have wine, cider, & mimosas. Cheers!",
      "link": "https://www.facebook.com/events/2147077445389409/",
      "class": "d-Block"
    },
    {
      "month": 7,
      "day": 3,
      "year": 2019,
      "title": "Party before the 4th!",
      "description": "Many have asked when we will do another special week night opening so we decided on July 3rd since the next day is a holiday! Enjoy mid-week brews at Vallensons and get your growler fills for your holiday celebration! Food Truck is TBD. Cheers!",
      "link": "https://www.facebook.com/events/482591839178727/",
      "class": "d-Block"
    },
    {
      "month": 7,
      "day": 12,
      "year": 2019,
      "title": "Stogies & Ales for Vets",
      "description": "The next Stogies and Ales for Veterans is this Friday! And it’s steak night!! Grab your cigars, your military brothers and sisters and enjoy great craft beer, a delicious C&S Rollin’ Smoke steak dinner, and live music by the awesome Bryan Shayne from 6-9pm! Cheers!",
      "link": "https://www.facebook.com/events/474385966692094/",
      "class": "d-Block"
    },
    {
      "month": 7,
      "day": 13,
      "year": 2019,
      "title": "Paws and Pints",
      "description": "Join us at Vallensons for our first fundraiser to Help Us, Help Them, Wag Again. There will be great food from Home Saddled BBQ, amazing beer (of course) from the brewmaster himself Valle, live music, raffles, and of course, doggos! ",
      "link": "https://www.facebook.com/events/1179346978914286/",
      "class": "d-Block"
    },
    {
      "month": 7,
      "day": 21,
      "year": 2019,
      "title": "July Jeep Meet",
      "description": "OlllllllO July Jeep Meet will be July 21st, 2-6pm. Food truck is TBD. Show us your Jeeps! Cheers!",
      "link": "https://www.facebook.com/events/566841597055084/",
      "class": "d-Block"
    },
    {
      "month": 8,
      "day": 1,
      "year": 2019,
      "title": "National IPA Day @ Vallensons!",
      "description": "We will have a special opening next Thursday, August 1st for NATIONAL IPA DAY!!! Come out and enjoy some IPAs!!! The V3 will be back on tap! Other styles will be on tap too. Cheers! Live Music: Patty O’Beers 6-9pm Food truck: Chalu’s Wings 5-9pm",
      "link": "https://www.facebook.com/events/2352543338185815/",
      "class": "d-Block"
    },
    {
      "month": 8,
      "day": 10,
      "year": 2019,
      "title": "Valle’s Bday Celebration/Two Fifths",
      "description": "Valle turns 45 on Aug 10!! Come celebrate with us! Live music by Two Fifths, delicious food by Home Saddled BBQ, and of course, Valle’s great craft beer! Cheers!",
      "link": "https://www.facebook.com/events/1480119315464673/",
      "class": "d-Block"
    },
    {
      "month": 8,
      "day": 17,
      "year": 2019,
      "title": "Mini DIY for Kids",
      "description": "Come on out and join us at Vallensons' Brewery from 3-5pm on Saturday, August 17th to support the FUMC Pearland MOPS Fall 2019 Kick Off! The event is open to the public. If you are looking for something to do with your kids, than come on out. Mention Pearland MOPS and get 5.00 off your price.",
      "link": "https://www.facebook.com/events/1058998287824561/",
      "class": "d-Block"
    },
    {
      "month": 9,
      "day": 7,
      "year": 2019,
      "title": "CML at Vallenson's Brewing Co in Pearland",
      "description": "4:00p-9:00p",
      "link": "https://www.facebook.com/events/417546565783244/",
      "class": "d-Block"
    },
    {
      "month": 9,
      "day": 8,
      "year": 2019,
      "title": "September Jeep Meet",
      "description": "OlllllllO We are long over due for a Jeep Meet! Show us your Jeeps! Food truck is TBD.",
      "link": "https://www.facebook.com/events/502000123958618/",
      "class": "d-Block"
    },
    {
      "month": 9,
      "day": 19,
      "year": 2019,
      "title": "Oldest Son’s Birthday Beer Release party",
      "description": "Many have been asking for another weekday opening so we are pairing up the next one with our oldest son’s birthday! He may not be old enough to drink yet but he has planned a special beer that will be released at this event. Chalu’s Wings will be the food truck of the evening. Come celebrate with us! Cheers!",
      "link": "https://www.facebook.com/events/893301067711356/",
      "class": "d-Block"
    },
    {
      "month": 9,
      "day": 19,
      "year": 2019,
      "title": "Annie & Kate at Vallensons Brewing Company",
      "description": "New show added to our schedule coming up soon! We'll be making our debut at Vallensons' Brewing Company! Stop by and see us next Thursday evening! ",
      "link": "https://www.facebook.com/events/470938573752454/",
      "class": "d-Block"
    },
    {
      "month": 9,
      "day": 27,
      "year": 2019,
      "title": "Oktoberfest 2019 Day 1",
      "description": "We will be kicking off our Oktoberfest weekend celebration with a German food menu by C&S Rollin’ Smoke and live music by Bryan Shayne from 6-9p! We will have special Vallensons’ Steins with the new logo for purchase; and of course, Valle’s Oktoberfest bier! More details to come on activities and contests!",
      "link": "https://www.facebook.com/events/416164492439578/",
      "class": "d-Block"
    },
    {
      "month": 9,
      "day": 28,
      "year": 2019,
      "title": "Oktoberfest 2019 Day 2",
      "description": "Our Oktoberfest weekend celebration will continue with a German food menu by Home Saddled BBQ from 4-9pm and live music by Patty O’Beers from 6-9pm. We will have special Vallensons’ Steins with the new logo for purchase; and of course, Valle’s Oktoberfest bier! More details to come on activities and contests!",
      "link": "https://www.facebook.com/events/452159538974312/",
      "class": "d-Block"
    },
    {
      "month": 10,
      "day": 11,
      "year": 2019,
      "title": "Bryan Shayne / Mobile Mai!",
      "description": "This Friday night, the Mobile Mai (Vietnamese) food truck will be here for the first time from 5-9pm. We will also have live music by the awesome Bryan Shayne from 6-9pm!",
      "link": "https://www.facebook.com/events/394708638112762/",
      "class": "d-Block"
    },
    {
      "month": 10,
      "day": 13,
      "year": 2019,
      "title": "October Jeep Meet",
      "description": "OlllllllO Our October Jeep Meet will be Oct 13th 2-6pm. Food Truck is TBD. Cheers!",
      "link": "https://www.facebook.com/events/359170874967152/",
      "class": "d-Block"
    },
    {
      "month": 10,
      "day": 18,
      "year": 2019,
      "title": "Annie & Kate | Vallensons' Brewing Company",
      "description": "★★★ Come up and see us at Vallensons' Brewing Company! We'll be on stage 6-9PM. Start your weekend with us and stop by! ★★★",
      "link": "https://https://www.facebook.com/events/2816327898391689/",
      "class": "d-Block"
    },
    {
      "month": 10,
      "day": 20,
      "year": 2019,
      "title": "3rd Annual Doggie Halloween Costume Contest",
      "description": "Come on out for our 3rd Annual Doggie Halloween Costume Contest!! Featured photo: the 2017 Funniest winner, One-Eyed Trucker! Bring your pups (on a leash) dressed up for some Halloween fun at the Brewery! Prizes for the Cutest, Funniest, and Most Creative dog costume! Enjoy the contest, cold beer, and football games! Food truck TBD! Registration starts at 1:30pm. Cheers!",
      "link": "https://www.facebook.com/events/564038900805323/",
      "class": "d-Block"
    },
    {
      "month": 10,
      "day": 20,
      "year": 2019,
      "title": "Trivia: Horror Movies",
      "description": "Come out for Trivia over Horror movies on Sunday, Oct 20th at 4pm!! Prize for winning team!!",
      "link": "https://www.facebook.com/events/2321981184782562/",
      "class": "d-Block"
    },
    {
      "month": 11,
      "day": 2,
      "year": 2019,
      "title": "Cousins Maine Lobster in Pearland",
      "description": "",
      "link": "https://www.facebook.com/events/568182077256984/",
      "class": "d-Block"
    },
    {
      "month": 11,
      "day": 3,
      "year": 2019,
      "title": "Blankets and Brews",
      "description": "Come create the infamous Chunky Knit Blanket at Vallenson's Brewery. Grab a pint of brew and a ball of yarn and let us teach you how to DIY a blanket. There is NO experience needed, and this is hand knitting. No needles allowed. Register for this unique and fun-filled opportunity!",
      "link": "https://www.facebook.com/events/460896488109674/",
      "class": "d-Block"
    },
    {
      "month": 11,
      "day": 10,
      "year": 2019,
      "title": "Sunday Funday and Membership Drive",
      "description": "Are you looking for a way to give back to your community? Exchange Club of Pearland celebrate it's 30th birthday in Pearland this year.  We are a group of men and women that exchange their time and talents and connections to better their community thru acts of service in AMERICANISM, COMMUNITY, YOUTH, and our National Focus of THE PREVENTION OF CHILD ABUSE. Come visit with us and see if you fit!  You might be a great volunteer, or organizer, or sponsor, or member!  There is a place for everyone in our group. Register for your FREE ticket so that we can know how many to expect and plan snacks accordingly. LOOK FORWARD TO MEETING YOU!",
      "link": "https://www.facebook.com/events/2474066396009163/",
      "class": "d-Block"
    },
    {
      "month": 11,
      "day": 29,
      "year": 2019,
      "title": "Annie & Kate/Nacho Nachos!",
      "description": "BLACK FRIDAY!! We will be open 3-10pm. Nacho Nachos will be serving #nextlevelnachos from 5-9pm. Live music by by the awesome duo, Annie and Kate, from 6-9pm. Cheers!!",
      "link": "https://www.facebook.com/events/692361311286744/",
      "class": "d-Block"
    },
    {
      "month": 12,
      "day": 1,
      "year": 2019,
      "title": "Blankets, Brews, & Brunch at the Brewery!",
      "description": "Many have asked for another Blankets, Brews, and Brunch at the Brewery event! The first event was a huge success! If you missed it, here’s another opportunity, Dec 1st! This beautiful blanket could be a great Christmas gift or keep it for yourself! Click on the link to register. Seats are limited. Arrive early to pick out yarn colors (first come first serve), enjoy brunch, and grab a beer, mimosa, wine, or cider. Will start promptly at 1pm. Brewery opens at 12pm. Cheers!",
      "link": "https://www.facebook.com/events/740928089759077/",
      "class": "d-Block"
    },
    {
      "month": 12,
      "day": 14,
      "year": 2019,
      "title": "Holiday Market! Sip and Shop at Vallensons!",
      "description": "Sip and Shop at Vallensons on Sat, Dec 14th from 12-5pm. Live music by Bryan Shayne from 6-9pm. C&S Rollin' Smoke will be the food truck of the day! VENDORS who are interested in having a booth should complete a vendor application by clicking on the "TICKETS" link. Vendor questions can be directed to KCevents30@gmail.com. Cheers!",
      "link": "https://www.facebook.com/events/2118088598499919/",
      "class": "d-Block"
    },
    {
      "month": 12,
      "day": 19,
      "year": 2019,
      "title": "Santa is Coming to Vallensons!",
      "description": "SAVE THE DATE: Santa is Coming to Vallensons on Thursday, Dec 19th at 6pm! Bring your family, the pups (on leash), your cameras, and take FREE pics with Santa! Our Christmas Ale, Root Beer, and Cream Soda will be back on tap! Malty and Hoppy, the silly elves, will be returning too!! Come out for this great event!",
      "link": "https://www.facebook.com/events/1867360743410530/",
      "class": "d-Block"
    }
  ]
}
